ЛИС2/src/Documents/АттестатАккредитации/АттестатАккредитации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АттестатАккредитации</name>
  <registerRecords>InformationRegister.лис_ПриложениеКАттестатуАккредитации</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАттестата</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОрганВыдавшийДокумент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВнесенияВРеестр</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Приложение</name>
    <attributes>
      <name>РазделУчета</name>
      <type>
        <types>EnumRef.РазделыУчетаЭкоаналитическогоКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗагрязняющееВещество</name>
      <type>
        <types>CatalogRef.ВеществаИПараметрыВАтмосферныхОсадках</types>
        <types>CatalogRef.КонтролируемыеПараметрыВПочвеДонныхОтложениях</types>
        <types>CatalogRef.ЗВВода</types>
        <types>CatalogRef.КонтролируемыеПоказателиВВоде</types>
        <types>CatalogRef.ФакторыФизическогоВоздействия</types>
        <types>CatalogRef.ЗВАтмосфера</types>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Методика</name>
      <type>
        <types>CatalogRef.МетодикиОпределенияИзмеренияАнализа</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ЛИС2/src/Documents/АттестатАккредитации/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗагрузитьИзExcel(Команда)
	ОткрытьФорму("Документ.АттестатАккредитации.Форма.ФормаЗагрузкиПриложенияИзExcel", , ЭтаФорма, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Перем Поле;
	
	// дата окончания действия
	Если ЗначениеЗаполнено(Объект.ДатаОкончанияДействия)  Тогда
		Если (Объект.ДатаОкончанияДействия <= Объект.ДатаВнесенияВРеестр) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата окончания действия должна быть больше даты внесения в реестр'"),,"ДатаОкончанияДействия","Объект",Отказ);
		КонецЕсли;
		
		Если (Объект.ДатаОкончанияДействия <= Объект.ДатаВыдачи) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Дата окончания действия должна быть больше даты выдачи'"),,"ДатаОкончанияДействия","Объект", Отказ);
		КонецЕсли;
	КонецЕсли;
	
	// приложение - диапазоны
	Для каждого ТекСтр Из Объект.Приложение Цикл
		Если ТекСтр.ДиапазонОт > ТекСтр.ДиапазонДо Тогда
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Приложение",ТекСтр.НомерСтроки,"ДиапазонОт");
            ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Нижняя граница диапазона должна быть меньше или равна верхней'"),,Поле,"Объект",Отказ);
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// вызовем проверку заполнения дополнительно при записи (при проведении вызывается автоматически)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Отказ = НЕ ПроверитьЗаполнение();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
